class Config:
    cooldown_period = 30
    cooldown_whitelist = ["2447209382"]
    activate_eat = True
    activate_TotalAst = True
    food = [
        "白菜",
        "史",
        "沧海",
        "小白菜",
        "花嫁白菜",
        "萝卜",
        "西北风",
        "白毛蓝衣大鼻涕",
        "土",
        "提拉米苏炖土豆",
        "奶油",
        "电子温度计",
        "一袋水泥",
        "太阳能板",
        "白葡萄酒煮白菜馅汤圆",
        "豆汁闷虾",
        "澐师傅",
        "🥬",
        "瓦罐萝卜白菜焖花椰菜",
        "瓦罐",
        "非洲之心",
        "钢笔的墨水",
        "人机的机油",
        "非洲之心",
        "可口小萝卜",
        "可口小白菜",
        "瓦罐泡面",
        "四重的奏",
        "星星的灵",
        "土豆丝炒姜丝",
        "生姜鸡块",
        "萝卜炒哈基米瓦罐",
        ".300 BLK",
        "7.62x51mm M993",
        "6.8x51mm Hybrid",
        ".50 BMG",
        ".338 lapua magnum",
        "9x39mm SP-6"
    ]
    stu = [
        "名草",
        "日奈",
        "玲美",
        "邮箱",
        "佳代子",
        "亚子",
        "草莓味小孩",
        "芒果味小孩",
        "巧克力味小孩",
        "小桃",
        "女仆形态的小桃",
        "小绿",
        "女仆形态的小绿",
        "柚子",
        "女仆形态的柚子",
        "爱丽丝",
        "女仆形态的爱丽丝",
        "Kei",
        "瓦尼瓦尼",
        "小夏",
        "乐队形态的小夏",
        "和纱",
        "乐队形态的和纱",
        "好美",
        "乐队形态的好美",
        "爱莉",
        "乐队形态的爱莉",
        "爱丽丝的头发",
        "美咲的发射器",
        "阿露",
        "新春阿露",
        "新春佳代子",
        "礼服佳代子",
        "遥香",
        "新春遥香",
        "睦月",
        "新春睦月",
    ]
    Total_Assault_bosslist = ["goz", "大蛇", "hod", "猫鬼", "主教", "寿司人", "气垫船若藻", "鸡斯拉", "切赛德", "白&黑", "格里高利"]
    Total_Assault_difficulty = ["Normal", "Hard", "VeryHard", "Hardcore", "extreme", "ins", "Torment"]
    activate_poke = True
    react = [
        "唔...",
        "唔嘿",
        "老师真的是...不要这么突然啦",
        "(´･ω･`)？",
    ]

    activate_congrat = True
    Congrats = [
        "老师是手气王，真幸运呢 恭喜",
    ]

    ai_group_whitelist = [225173408]
    ai_usr_whitelist = ["2891544717"]